<?php
/*
|--------------------------------------------------
| 基本框架配置
|-------------------------------------------------- 
*/
return [
	/*
	|----------------------------------------------
	| 脚手架url前缀 
	|----------------------------------------------
	*/
	'scaffold_route_prefix' => 'backend',

	/*
	|----------------------------------------------
	| 是否为脚手架启用用户认证
	|----------------------------------------------
	| 脚手架所使用的用户认证功能是Laravel框架默认自带的，所以
	| 如果脚手架启用用户认证则需要安装laravel的auth模块
	*/
	'admin_enable' => false,
	
	/*
	|----------------------------------------------
	| 是否为脚手架启用用户授权验证
	|----------------------------------------------
	| 只有当 admin_enable=true 时 auth_enable 为true时才会生效 
	*/
	'auth_enable' => false,

	/*
	|----------------------------------------------
	| 默认登陆地址
	|----------------------------------------------
	| 当前使用的是laravel默认调用的用户认证模块的url 
	*/
	'login_url' => '/login',
	
	/*
	|----------------------------------------------
	| 代码生成器
	|----------------------------------------------
	| 对代码生成器进行配置
	*/
	'codemaker' => array(
		'db' => 'mysql', //业务系统数据库
	),
];
